## Production: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_iam_policy.pr_review_env`                                   |
|        | `aws_iam_role_policy_attachment.pr_review_env`                   |
|        | `module.pr_review_env.aws_iam_role.this[&quot;pr-review-env-manage&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.pr_review_env will be created
  + resource "aws_iam_policy" "pr_review_env" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "pr-review-env-manage"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:UpdateFunctionUrlConfig",
                          + "lambda:UpdateFunctionConfiguration",
                          + "lambda:UpdateFunctionCode",
                          + "lambda:PutFunctionConcurrency",
                          + "lambda:ListFunctionUrlConfigs",
                          + "lambda:GetFunctionUrlConfig",
                          + "lambda:GetFunctionConfiguration",
                          + "lambda:GetFunction",
                          + "lambda:DeleteFunctionUrlConfig",
                          + "lambda:DeleteFunctionConcurrency",
                          + "lambda:DeleteFunction",
                          + "lambda:CreateFunctionUrlConfig",
                          + "lambda:CreateFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ca-central-1:521732289257:function:pr-review-env-*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::521732289257:role/pr-review-env"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchDeleteImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:521732289257:repository/website-staging-container"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role_policy_attachment.pr_review_env will be created
  + resource "aws_iam_role_policy_attachment" "pr_review_env" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pr-review-env-manage"
    }

  # module.pr_review_env.aws_iam_role.this["pr-review-env-manage"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/digital-canada-ca-website:pull_request",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::521732289257:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pr-review-env-manage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "digital-canada-website-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "digital-canada-website-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.website_staging_container"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr_review_env"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
